notes/emacs_packages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Packages</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">Emacs Packages</h1>
<div id="outline-container-org288bce4" class="outline-2">
<h2 id="org288bce4">Emacs Packages</h2>
<div class="outline-text-2" id="text-org288bce4">
<p>
Emacs is Incredibly extensive, it allows you to configure everything the way you like.
Because of this, there are now many Emacs packages out there and the ones below are some I have documented.
</p>
</div>

<div id="outline-container-orgfcfea06" class="outline-3">
<h3 id="orgfcfea06">Some Emacs packages</h3>
<div class="outline-text-3" id="text-orgfcfea06">
<p>
I just shy of 100 packages (and yet my session is very optimised), these are some I have chosen to document:
</p>

<p>
<a href="org_mode.html#ID-31075352-280e-4ef1-978e-5c189da43657">org-mode</a> - The center of all these org* packages. The incredible text format to rule them all!
<a href="org_roam.html#ID-8317049b-5a2b-4176-9d39-111f310061c7">org-roam</a> - Note taking system (These notes are made with Orgroam)
<a href="org_reveal.html#ID-048f9912-1412-425b-b331-cfb7af8a8047">org-reveal</a> - Creating Web Presentations
<a href="bufler.html#ID-c2647c82-ae0a-4d26-aa62-706a6a8051d4">Bufler</a> - Managing buffers
<a href="transient.html#ID-6a9051c1-b014-4c07-ba52-1dbd9f88220d">Transient</a> - A custom UI system (Very useful when programming)
<a href="notmuch.html#ID-92cab502-d6ab-47fe-9355-3f5a6c07cf68">Notmuch</a> - My Favourite Email Client
<a href="mu4e.html#ID-d71d294a-b8e3-48e3-8295-3d373bcd9681">Mu4e</a> - Email Client (I don't use this anymore)
</p>
</div>
</div>
</div>


<div id="outline-container-org56b06cd" class="outline-2">
<h2 id="org56b06cd">Links to this note</h2>
<div class="outline-text-2" id="text-org56b06cd">
<ul class="org-ul">
<li><a href="./emacs.html">Emacs</a></li>
<li><a href="./emacs.html">Emacs</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:haider@haider.gq'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgmode in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
